assi2/cavity/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (1.2 0 0);
    }

    wallBottom
    {
        type            noSlip;
    }

     in1
    {
        type            noSlip;
    }  
  in2
    {
        type            noSlip;
    }
  out1
    {
        type            noSlip;
    }
	out2
    {
        type            noSlip;
    }
      sides1_half0
    {
        type            empty;
    }
          sides1_half1
    {
        type            empty;
    }
          sides2_half0
    {
        type            empty;
    }
          sides2_half1
    {
        type            empty;
    }
}

// ************************************************************************* //
