assi2/cavity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type            zeroGradient;
    }

    wallBottom
    {
        type            zeroGradient;
    }

  in1
    {
        type            zeroGradient;
    }  
  in2
    {
        type            zeroGradient;
    }
  out1
    {
        type            zeroGradient;
    }
  out2
    {
        type            zeroGradient;
    }
      sides1_half0
    {
        type            empty;
    }
          sides1_half1
    {
        type            empty;
    }
          sides2_half0
    {
        type            empty;
    }
          sides2_half1
    {
        type            empty;
    }
    
}

// ************************************************************************* //
