assi2/cavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    wallBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          34;
        startFace       2244;
    }
    movingWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          34;
        startFace       2278;
    }
    in1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          17;
        startFace       2312;
    }
    out1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          17;
        startFace       2329;
    }
    in2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          17;
        startFace       2346;
    }
    out2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          17;
        startFace       2363;
    }
    sides1_half0
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          578;
        startFace       2380;
    }
    sides1_half1
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          578;
        startFace       2958;
    }
    sides2_half0
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          578;
        startFace       3536;
    }
    sides2_half1
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          578;
        startFace       4114;
    }
)

// ************************************************************************* //
