assi2/cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  | Author: Manan Mohnot
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// roll number 190110043 therfore X = 20 + (4+3)*2 = 34

vertices
(
    (0 0 0)
    (0.2 0 0)
    (0 0.1 0)
    (0.2 0.1 0)
    (0 0.2 0)
    (0.2 0.2 0)
    (0 0 0.1)
    (0.2 0 0.1)
    (0 0.1 0.1)
    (0.2 0.1 0.1)
    (0 0.2 0.1)
    (0.2 0.2 0.1)
);

blocks
(
    hex (0 1 3 2 6 7 9 8) (34 17 1) simpleGrading (1 20 1)
    hex (2 3 5 4 8 9 11 10) (34 17 1) simpleGrading (1 0.05 1)
);

edges
(
);

boundary
(
    wallBottom
    {
        type            wall;
        faces           ((0 1 7 6));
    }
    // wallTop
    movingWall
    {
        type            wall;
        faces           ((4 10 11 5));
    }
    
    in1
    {
        type            wall;
        neighbourPatch  out1;
        faces           ((0 6 8 2));
    }
    out1
    {
        type            wall;
        neighbourPatch  in1;
        faces           ((1 3 9 7));
    }
    
    in2
    {
        type            wall;
        neighbourPatch  out2;
        faces           ((2 8 10 4));
    }
    out2
    {
        type            wall;
        neighbourPatch  in2;
        faces           ((3 5 11 9));
    }
    
    sides1_half0
    {
        type            empty;
        faces           ((0 2 3 1));
    }
    sides1_half1        
    {
        type            empty;
        faces           ((6 7 9 8));
    }

    sides2_half0
    {
        type            empty;
        faces           ((2 4 5 3));
    }
    sides2_half1
    {
        type            empty;
        faces           ((8 9 11 10));
    }    
);

mergePatchPairs
(
);

// ************************************************************************* //
